glocklueng/032/LayerOne_2014/badge/code/stm32-prox/main.c
/*
								XXXXXX                                                         XXX
								 XX  XX                                                         XX
								 XX  XX  XX XXX     XXXX   XX   XX  XXX XX    XXXXX   XX XXX    XX  XX
								 XXXXX    XXX XX   XX  XX   XX XX   XX X XX       X    XXX XX   XX XX
								 XX       XX       XX  XX    XXX    XX X XX  XXXXXX    XX       XXX
								 XX       XX       XX  XX   XX XX   XX   XX  X   XX    XX       XX XX
								XXXX     XXXX       XXXX   XX   XX  XXX  XXX XXXXX X  XXXX     XXX  XX 		
								  
								  													L12 2014 Edition 10th Anniversary
								  

								  LayerOne 2014 - www.layerone.org

 
 charliex - nullspacelabs.com

*/

#include <string.h>
#include <stdarg.h>
#include <stdlib.h>

// STM32 Library
#include "stm32f10x_lib.h"
#include "usb_lib.h"

// defines for hardware board
#include "l1_board.h"
#include "hw_config.h"
#include "proxmark3.h"
#include "apps.h"

#include "logos.h"
#include "printf.h"

int  RCC_Configuration(void);
void NVIC_Configuration(void);
void LEDsSet (unsigned int State);
void TimingDelay_Decrement(void);

// Data

static vu32 TimingDelay;

SPI_InitTypeDef  SPI_InitStructure;   

/*******************************************************************************
* Function Name  : NVIC_Configuration
* Description    : Configures Vector Table base location.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void NVIC_Configuration(void)
{
#ifdef  VECT_TAB_RAM  
  /* Set the Vector Table base location at 0x20000000 */ 
  NVIC_SetVectorTable(NVIC_VectTab_RAM, 0x0); 
#else  /* VECT_TAB_FLASH  */
  /* Set the Vector Table base location at 0x08000000 */ 
  NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);   
#endif
}

/*************************************************************************
 * Function Name: LEDSet
 * Parameters: unsigned int State, 0 off, 1 on
 *
 * Return: none
 *
 * Description: Set LEDS State
 *
 *************************************************************************/
void LEDSet (unsigned char State)
{
  GPIO_WriteBit(LED_PORT,LED_PIN  ,State?Bit_SET:Bit_RESET);
}

void SetSpeaker(unsigned int delay)
{
  GPIO_WriteBit(SPEAKER_PORT,SPEAKER_PIN,Bit_SET); 
  DelayuS(delay );	
  GPIO_WriteBit(SPEAKER_PORT,SPEAKER_PIN,Bit_RESET);  
}

/*******************************************************************************
* Function Name  : Delay
* Description    : Inserts a delay time.
* Input          : nCount: specifies the delay time length.
* Output         : None
* Return         : None
*******************************************************************************/
void DelayuS(vu32 nCount)
{  
  while (nCount--);
}

/*******************************************************************************
* Function Name  : Delay
* Description    : Inserts a delay time.
* Input          : nTime: specifies the delay time length, in milliseconds.
* Output         : None
* Return         : None
*******************************************************************************/
void DelaymS(u32 nTime)
{
  /* Enable the SysTick Counter */
  SysTick_CounterCmd(SysTick_Counter_Enable);
  
  TimingDelay = nTime;

  while(TimingDelay != 0);

  /* Disable SysTick Counter */
  SysTick_CounterCmd(SysTick_Counter_Disable);
  
  /* Clear SysTick Counter */
  SysTick_CounterCmd(SysTick_Counter_Clear);
}

/*******************************************************************************
* Function Name  : TimingDelay_Decrement
* Description    : Decrements the TimingDelay variable.
* Input          : None
* Output         : TimingDelay
* Return         : None
*******************************************************************************/
void TimingDelay_Decrement(void)
{
  if (TimingDelay != 0x00)
  { 
    TimingDelay--;
  }
}
//=============================================================================
// Debug print functions, to go out over USB, to the usual PC-side client.
//=============================================================================

void DbpString(char *str)
{
  if (str) {
  	OLEDPutstr(str);
  	OLEDDraw();
  }
}

void DbpBigString(char *str)
{
  if (str) {
  	OLEDPutBigstr(str);
  	OLEDDraw();
  }
}

void Dbprintf(const char *fmt, ...) {
// should probably limit size here; oh well, let's just use a big buffer
	char output_string[128];
	va_list ap;

	va_start(ap, fmt);
	vsprintf(output_string, fmt,ap);
	va_end(ap);

	DbpString(output_string);
}

void DbBigprintf(const char *fmt, ...) 
{
// should probably limit size here; oh well, let's just use a big buffer
	char output_string[128];
	va_list ap;

	va_start(ap, fmt);
	vsprintf(output_string, fmt,ap);
	va_end(ap);

	DbpBigString(output_string);
}


#ifdef  DEBUG
/*******************************************************************************
* Function Name  : assert_failed
* Description    : Reports the name of the source file and the source line number
*                  where the assert_param error has occurred.
* Input          : - file: pointer to the source file name
*                  - line: assert_param error line source number
* Output         : None
* Return         : None
*******************************************************************************/
void assert_failed(u8* file, u32 line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
    
    asm("bkpt #00");
    
  }
}
#endif


// Setup CPU GPIO's etc.
void InitBoard( void ) 
{
	USB_Interrupts_Config();
	Set_USBClock();
	USB_Init();
}

extern uint16_t  ADC_Ampl[2];

//-----------------------------------------------------------------------------
// Read an ADC channel and block till it completes, then return the result
// in ADC units (0 to 1023). Also a routine to average 32 samples and
// return that.
// STM32 gives us (0..4095) 12 bit
//-----------------------------------------------------------------------------
#if DMA_ADC == 1
static unsigned int ReadAdc(int ch)
{
	return ADC_Ampl[1-ch]/4;
}
#else
static unsigned int ReadAdc(int ch)
{

  if( ch == 0  ){
//    ADC_SoftwareStartConv(ADC1);//Start the conversion
 	while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));//Processing the conversion
	 return ADC_GetConversionValue(ADC1)/4; //Return the converted data
  } else {
  //  ADC_SoftwareStartConv(ADC2);//Start the conversion
 	while(!ADC_GetFlagStatus(ADC2, ADC_FLAG_EOC));//Processing the conversion
	 return ADC_GetConversionValue(ADC2)/4; //Return the converted data
  }
}
#endif

int AvgAdc(int ch) // was static - merlok
{
  unsigned int i;
  unsigned int a = 0;
  
  for(i = 0; i < 32; i++) {
    a += ReadAdc(ch);
  }
  
