glocklueng/032/LayerOne_2014/badge/code/stm32-prox/main.c
  // convert to what the proxmark expects 0..1025 (we should change the code to allow the better resolution
//  a /= 4;
  
  return (a + 15) >> 5;
}

bool cmd_send(uint32_t cmd, uint32_t arg0, uint32_t arg1, uint32_t arg2, void* data, size_t len)
{
  return 0;
}

// The large multi-purpose buffer, typically used to hold A/D samples,
// maybe processed in some way.
uint32_t BigBuf[BIG_BUFFER];

void MeasureAntennaTuning(void)
{
  uint8_t *dest = (uint8_t *)BigBuf+FREE_BUFFER_OFFSET;
  int i, adcval = 0, peak = 0, peakv = 0, peakf = 0; //ptr = 0 
  int vLf125 = 0, vLf134 = 0, vHf = 0;	// in mV
  
  //	UsbCommand c;
  
  OLEDClear();
  
  LED_B_ON();
  DbpString("Measuring antenna\nPlease wait...\n");
  memset(dest,0,sizeof(FREE_BUFFER_SIZE));
  
  /*
  * Sweeps the useful LF range of the proxmark from
  * 46.8kHz (divisor=255) to 600kHz (divisor=19) and
  * read the voltage in the antenna, the result left
  * in the buffer is a graph which should clearly show
  * the resonating frequency of your LF antenna
  * ( hopefully around 95 if it is tuned to 125kHz!)
  */
  
  FpgaWriteConfWord(FPGA_MAJOR_MODE_LF_READER);
  for (i=255; i>19; i--) {
    
    WDT_HIT();
    
    FpgaSendCommand(FPGA_CMD_SET_DIVISOR, i);
    SpinDelay(20);
    // Vref = 3.3V, and a 10000:240 voltage divider on the input
    // can measure voltages up to 137500 mV
    adcval = ((137500 * AvgAdc(ADC_CHAN_LF)) >> 10);
    if (i==95) 	vLf125 = adcval; // voltage at 125Khz
    if (i==89) 	vLf134 = adcval; // voltage at 134Khz
    
    dest[i] = adcval>>8; // scale int to fit in byte for graphing purposes
    if(dest[i] > peak) {
      peakv = adcval;
      peak = dest[i];
      peakf = i;
      //ptr = i;
    }
  }
  
  LED_A_ON();
  // Let the FPGA drive the high-frequency antenna around 13.56 MHz.
  FpgaWriteConfWord(FPGA_MAJOR_MODE_HF_READER_RX_XCORR);
  SpinDelay(20);
  // Vref = 3300mV, and an 10:1 voltage divider on the input
  // Vref = 3340mV, and an 10:1 voltage divider on the input
  // can measure voltages up to 33000 mV
  vHf = (VDD_MV * AvgAdc(ADC_CHAN_HF)) >> 10;
  
  //	c.cmd = CMD_MEASURED_ANTENNA_TUNING;
  //	c.arg[0] = (vLf125 << 0) | (vLf134 << 16);
  //	c.arg[1] = vHf;
  //	c.arg[2] = peakf | (peakv << 16);
  
  OLEDClear();
  DbpString("Results\n");
  Dbprintf("LF %5.2fV @ 125kHz\n",vLf125/1000.0f);
  Dbprintf("LF %5.2fV @ 134.00kHz\n\n",vLf134/1000.0f);
  
  Dbprintf("LF optimal: %5.2fV @%.2f kHz\n", peakv / 1000.0, (12000.0 / (peakf + 1.0)) );
  Dbprintf("HF antenna: %5.2fV @13.56 MHz\n", (vHf / 1000.0));
  
  if(  peakv < 2000 )
    DbpString("Your LF antenna is unusable.\n");
  else if (peakv < 10000 )
    DbpString("Your LF antenna is marginal.\n");
  else 
    DbpString("Your LF antenna is good.\n");
  
  if ( vHf < 2000 )
    DbpString("Your HF antenna is unusable.\n");
  else if ( vHf < 5000  )
    DbpString("Your HF antenna is marginal.\n");
  else 
    DbpString("Your HF antenna is good.\n");
  
  
  cmd_send(CMD_MEASURED_ANTENNA_TUNING,vLf125|(vLf134<<16),vHf,peakf|(peakv<<16),0,0);
  //UsbSendPacket((uint8_t *)&c, sizeof(c));
  FpgaWriteConfWord(FPGA_MAJOR_MODE_OFF);
  LED_A_OFF();
  LED_B_OFF();
  return;
}

void MeasureAntennaTuningHf(void)
{
  unsigned char ch;
  
  int vHf = 0;	// in mV
  
  OLEDClear();
  
  DbpString("Measuring HF antenna\nPress button to exit\n\n");
  
  //FpgaSetupSsc(1);
  
  for (;;) {
    // Let the FPGA drive the high-frequency antenna around 13.56 MHz.
    FpgaWriteConfWord(FPGA_MAJOR_MODE_HF_READER_RX_XCORR);
    SpinDelay(20);
    // Vref = 3300mV, and an 10:1 voltage divider on the input
    // Vref = 3400mV, and an 10:1 voltage divider on the input
    // can measure voltages up to 33000 mV
    vHf = (VDD_MV * AvgAdc(ADC_CHAN_HF)) >> 10;
    
    Dbprintf("\r%d mV           ",vHf/10);
         
    if (BUTTON_PRESS()) 
      break;
  }
  //FpgaSetupSsc(0);
  DbpString("\nCancelled");
}


void test_fpga()
{
  
  return;
  
  int i;
  
  FpgaWriteConfWord(FPGA_MAJOR_MODE_LF_READER);
  
  for (i=255; i>19; i--) {
    
    WDT_HIT();
    
    FpgaSendCommand(FPGA_CMD_SET_DIVISOR, i);
    
    DelaymS(5000);
  }
  
  FpgaWriteConfWord(FPGA_MAJOR_MODE_OFF);	
}


// ARM Pins that can generate a 24Mhz signal via TIMx (HW Rev2)
//----------------------------------------------------------
// TIM1_CH1 pin  (PA8)  - FPGA_CCLK - cant be moved, programming pins only
// TIM1_CH1N pin (PB13) - MUX not connected to FPGA

// TIM1_CH2 pin  (PA9)  - FPGA_DIN cant be moved, programming pins only
// TIM1_CH2N pin (PB14) - MUX not connected to FPGA

// TIM1_CH3 pin  (PA10) - FPGA_DOUT cant be moved (not used) can be reassigned!
// TIM1_CH3N pin (PB15) - MUX not connected to FPGA

// TIM1_CH4 pin  (PA11) - USB cant use


// PCK0 needs to run at 24Mhz, main clock is 72MHz, so div 3
// Moved to DOUT PA10, FPGA matches now too.
void SetupPCK0Clock(void)
{
  uint16_t Period;
  
  GPIO_InitTypeDef GPIO_InitStructure;
  TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
  TIM_OCInitTypeDef TIM_OCInitStructure;
  
  Period = (SystemCoreClock / 24000000); // Must be divisable
  
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  
  // Map TIM1 OC2/OC3
  GPIO_PinRemapConfig(GPIO_PartialRemap_TIM1,ENABLE);
  
  // Enable Timer1 clock and release reset
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1,ENABLE);
  RCC_APB2PeriphResetCmd(RCC_APB2Periph_TIM1,DISABLE);
  
  TIM_InternalClockConfig(TIM1);
  
  // Time base configuration
  TIM_TimeBaseStructure.TIM_Prescaler = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseStructure.TIM_Period = Period-1; 
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
  TIM_TimeBaseInit(TIM1,&TIM_TimeBaseStructure);
  
  // Channel 2 Configuration in PWM1 mode
  // PWM1 gives a rounder pulse
  // PWM2 gives a more pointed
  TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
  TIM_OCInitStructure.TIM_OutputNState  = TIM_OutputNState_Enable;
  TIM_OCInitStructure.TIM_Pulse = Period/2;
  TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
  TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCIdleState_Reset;
  TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High;
  TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
    
  // TI CH3 Init
  TIM_OC3Init(TIM1,&TIM_OCInitStructure);
  
