glocklueng/032/LayerOne_2014/badge/code/stm32-prox/main.c
  TIM_CtrlPWMOutputs(TIM1,ENABLE);
  
  // TIM1 counter enable
  TIM_Cmd(TIM1,ENABLE);
}


// compose fc/8 fc/10 waveform
static void fc(int c, int *n) 
{
	uint8_t *dest = (uint8_t *)BigBuf;
	int idx;

	// for when we want an fc8 pattern every 4 logical bits
	if(c==0) {
		dest[((*n)++)]=1;
		dest[((*n)++)]=1;
		dest[((*n)++)]=0;
		dest[((*n)++)]=0;
		dest[((*n)++)]=0;
		dest[((*n)++)]=0;
		dest[((*n)++)]=0;
		dest[((*n)++)]=0;
	}
	//	an fc/8  encoded bit is a bit pattern of  11000000  x6 = 48 samples
	if(c==8) {
		for (idx=0; idx<6; idx++) {
			dest[((*n)++)]=1;
			dest[((*n)++)]=1;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
		}
	}

	//	an fc/10 encoded bit is a bit pattern of 1110000000 x5 = 50 samples
	if(c==10) {
		for (idx=0; idx<5; idx++) {
			dest[((*n)++)]=1;
			dest[((*n)++)]=1;
			dest[((*n)++)]=1;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
			dest[((*n)++)]=0;
		}
	}
}

// prepare a waveform pattern in the buffer based on the ID given then
// simulate a HID tag until the button is pressed
void CmdHIDsimTAG(int hi, int lo, int ledcontrol)
{
	int n=0, i=0;
	/*
	 HID tag bitstream format
	 The tag contains a 44bit unique code. This is sent out MSB first in sets of 4 bits
	 A 1 bit is represented as 6 fc8 and 5 fc10 patterns
	 A 0 bit is represented as 5 fc10 and 6 fc8 patterns
	 A fc8 is inserted before every 4 bits
	 A special start of frame pattern is used consisting a0b0 where a and b are neither 0
	 nor 1 bits, they are special patterns (a = set of 12 fc8 and b = set of 10 fc10)
	*/

	if (hi>0xFFF) {
		DbpString("Tags can only have 44 bits.");
		return;
	}
	fc(0,&n);
	// special start of frame marker containing invalid bit sequences
	fc(8,  &n);	fc(8,  &n);	// invalid
	fc(8,  &n);	fc(10, &n); // logical 0
	fc(10, &n);	fc(10, &n); // invalid
	fc(8,  &n);	fc(10, &n); // logical 0

	WDT_HIT();
	// manchester encode bits 43 to 32
	for (i=11; i>=0; i--) {
		if ((i%4)==3) fc(0,&n);
		if ((hi>>i)&1) {
			fc(10, &n);	fc(8,  &n);		// low-high transition
		} else {
			fc(8,  &n);	fc(10, &n);		// high-low transition
		}
	}

	WDT_HIT();
	// manchester encode bits 31 to 0
	for (i=31; i>=0; i--) {
		if ((i%4)==3) fc(0,&n);
		if ((lo>>i)&1) {
			fc(10, &n);	fc(8,  &n);		// low-high transition
		} else {
			fc(8,  &n);	fc(10, &n);		// high-low transition
		}
	}

	if (ledcontrol)
		LED_A_ON();
	SimulateTagLowFrequency(n, 0, ledcontrol);

	if (ledcontrol)
		LED_A_OFF();
}

void SimulateTagLowFrequency(int period, int gap, int ledcontrol)
{
	int i;
	uint8_t *tab = (uint8_t *)BigBuf;
      
	OLEDClear();
  
      	OLEDPutstr("SimulateTagLowFrequency\n");
	Dbprintf("Period = %d\nGap = %d\n", period, gap );
	OLEDDraw();
	 
	FpgaWriteConfWord(FPGA_MAJOR_MODE_LF_EDGE_DETECT);
    /*
	AT91C_BASE_PIOA->PIO_PER = GPIO_SSC_DOUT | GPIO_SSC_CLK;//Pin Enable Register
    
	AT91C_BASE_PIOA->PIO_OER = GPIO_SSC_DOUT;//Output Enable Register
	AT91C_BASE_PIOA->PIO_ODR = GPIO_SSC_CLK;//Output Disable Register
    */
	

// SSP_DOUT(PB5)(GPIO_SSC_DOUT) -> SSP_DOUT(P5) (ssp_dout)
	
#define SHORT_COIL()	LOW( GPIO_SSC_DOUT )
#define OPEN_COIL()	HIGH( GPIO_SSC_DOUT )
    
	i = 0;
	for(;;) {
		// SSP_CLK(P9(ssp_clk) -> SSP_CLK_PIN GPIOB/GPIO_Pin_2(SSP_CLK) 
		while(!(GETBIT(GPIO_SSC_CLK))) {
			if(BUTTON_PRESS()) {
				DbpString("Stopped");
				return;
			}
			WDT_HIT();
		}
        
		if (ledcontrol)
			LED_D_ON();
        
		if(tab[i])
			OPEN_COIL();
		else
			SHORT_COIL();
        
		if (ledcontrol)
			LED_D_OFF();
        
		while( GETBIT( GPIO_SSC_CLK )) {
			if(BUTTON_PRESS()) {
				DbpString("Stopped");
				return;
			}
			WDT_HIT();
		}
        
		i++;
		if(i == period) {
			i = 0;
			if (gap) {
				SHORT_COIL();
				SpinDelayUs(gap);
			}
		}
	}
}

void cycleFPGAMode( void ) {

  static unsigned short pFPGAMode = 0;
  
  // Debug FPGA modes
  switch( pFPGAMode ) {
  	case  0:
       		FpgaWriteConfWord(FPGA_MAJOR_MODE_LF_READER);
		break;
  	case  1:
	  	FpgaWriteConfWord(FPGA_MAJOR_MODE_LF_EDGE_DETECT);
		break;
  	case  2:
  		FpgaWriteConfWord(FPGA_MAJOR_MODE_HF_READER_TX);
		break;
  	case  3:
	  	FpgaWriteConfWord(FPGA_MAJOR_MODE_HF_READER_RX_XCORR);
		break;
  	case  4:
  		FpgaWriteConfWord(FPGA_MAJOR_MODE_HF_SIMULATOR);
		break;
  	case  5:
  		FpgaWriteConfWord(FPGA_MAJOR_MODE_HF_ISO14443A);
		break;
  	case  6:
  		FpgaWriteConfWord(FPGA_MAJOR_MODE_LF_PASSTHRU);
		break;
  	default:
  		FpgaWriteConfWord(FPGA_MAJOR_MODE_OFF);
		pFPGAMode = 0;
		return;

  }
  
  pFPGAMode++; 
  
}  

/*
  OBJECTIVE
  	Listen and detect an external reader. Determine the best location
  	for the antenna.

  INSTRUCTIONS:
  	Inside the ListenReaderField() function, there is two mode.
  	By default, when you call the function, you will enter mode 1.
  	If you press the PM3 button one time, you will enter mode 2.
  	If you press the PM3 button a second time, you will exit the function.

  DESCRIPTION OF MODE 1:
  	This mode just listens for an external reader field and lights up green
  	for HF and/or red for LF. This is the original mode of the detectreader
  	function.

  DESCRIPTION OF MODE 2:
  	This mode will visually represent, using the LEDs, the actual strength of the
	 current compared to the maximum current detected. Basically, once you know
  	what kind of external reader is present, it will help you spot the best location to place
  	your antenna. You will probably not get some good results if there is a LF and a HF reader
  	at the same place! :-)

*/

static unsigned short hf_values[128];
static unsigned short hf_high = 1;
static unsigned char hf_gcount = 0;
static unsigned short lf_values[128];
static unsigned short lf_high = 1;
static unsigned char lf_gcount = 0;

void ListenReaderField(int limit)
{
  int lf_av, lf_av_new, lf_baseline= 0, lf_count= 0, lf_max;
  int hf_av, hf_av_new,  hf_baseline= 0, hf_count= 0, hf_max;
  int mode=1 ,i;
  
#define LF_ONLY		(1)
#define HF_ONLY		(2)
  
  OLEDClear();
  LEDsoff();
  
