glocklueng/032/LayerOne_2014/badge/code/stm32-prox/main.c
  memset(hf_values,0,sizeof(hf_values));
  hf_high = 1;hf_count=0;
  
  memset(lf_values,0,sizeof(hf_values));
  lf_high = 1;lf_count=0;
  
  //charliex: changed from ReadAdc to AvgAdc
  lf_av = lf_max=AvgAdc(ADC_CHAN_LF);
  
  if(limit != HF_ONLY) {
    Dbprintf("LF 125/134 Baseline: %d\n", lf_av);
    lf_baseline = lf_av;
  }
  
  hf_av=hf_max=AvgAdc(ADC_CHAN_HF);
  
  if (limit != LF_ONLY) {
    Dbprintf("HF 13.56 Baseline: %d\n", hf_av);
    hf_baseline = hf_av;
  }
  
  DelaymS( 4000 );
  
  OLEDClear();
  
  for(;;) {
    
    if (BUTTON_PRESS()) {
      SpinDelay(500);
      switch (mode) {
      case 1:
	mode=2;
	OLEDSetCursor(0,0);
	DbpString("Signal Strength Mode\n");
	break;
      case 2:
      default:
	OLEDSetCursor(0,6);
	DbpString("Stopped\n");
	LEDsoff();
	DelaymS(1000);
	return;
	break;
      }
    }
    WDT_HIT();
    
    if (limit != HF_ONLY) {
      if(mode==1) {
	if (abs(lf_av - lf_baseline) > 10) LED_D_ON();
	else                               LED_D_OFF();
      }
      
      ++lf_count;
      lf_av_new= ReadAdc(ADC_CHAN_LF);
      
      // see if there's a significant change
      if( abs( lf_av - lf_av_new ) > 10 ) {
	
	OLEDSetCursor(0,0);
	
	Dbprintf("\n\nLF 125/134 Field Change    \n    %x %x %x          \n", lf_av, lf_av_new, lf_count);
	
	lf_av = lf_av_new;
	if (lf_av > lf_max)
	  lf_max = lf_av;
	lf_count= 0;
      }
    }
    
    if (limit != LF_ONLY) {
      if (mode == 1){
	if (abs(hf_av - hf_baseline) > 10) LED_B_ON();
	else                               LED_B_OFF();
      }
      
      ++hf_count;
      hf_av_new= ReadAdc(ADC_CHAN_HF);
      
      // see if there's a significant change
      
      if(abs(hf_av - hf_av_new) > 10) {
	
	OLEDSetCursor(0,5);
	Dbprintf("HF 13.56 Field Change    \n    %x %x %x               \n", hf_av, hf_av_new, hf_count);
	hf_av = hf_av_new;
	if (hf_av > hf_max){
	  hf_max = hf_av;
	}
	hf_count= 0;
      }
    }
   
    if(mode == 2) {
      
      float div;
       
      if (limit != LF_ONLY) {
	
	div = 128.0f / hf_max;
	
	// store at current pos
	hf_values[hf_gcount] = hf_av;
	hf_gcount++;
	hf_gcount%=128;
      }
      
      if (limit != HF_ONLY){
	
	div = 128.0f / lf_max;
	
	// store at current pos
	lf_values[lf_gcount] = lf_av;
	lf_gcount++;
	lf_gcount %= 128;
	
      }
      
      hf_high = 0; lf_high = 0;
      
      for( i = 0 ; i  < 128; i++ ) {
	
	if( hf_values[i] > hf_high ) {
	  hf_high  = hf_values[i];
	}
	
	if( lf_values[i] > lf_high ) {
	  lf_high  = lf_values[i];
	}
      }
      
      for( i = 0 ; i  < 128; i ++ ) {
        
	// up/down
	div = 64.0f / 1024.0f;
	  
	OLEDSetPixel( i, (short)(div*(float)hf_values[i])  ,1 );
	
      }
    }
  }
}
/*

  ca 83 19 86 99 85 e0 26 85 66 80 6c 53 86 5e 62 64 bf 
  78 37 d8 2f e3 1d fc f7 1a 3a ce 58 68 bd 55 ec 75 e1 
  7e 6f e1 12 76 c9 2d 10 03 6e 79 3c b8 2e 80 9e 4b ee 
  d5 f4 e6 6d 39 82 1b dc 6b 22 ab 17 b8 43 10 a7 3f 5a 
  a1 24 32 3a fe 17 aa f4 81 6a c2 fd 24 87 46 ae cc fe 
  3f 8d 26 4c 2d 71 8a ac 6a ce d7 68 97 b2 80 b6 85 c6 
  29 f9 22 d1 91 d7 d5 1c db c4 80 90

  24 2a 60 de a3 a8 36 9a 66 e1 52 d0 8d ce d0 bb e7 f3 
  b0 a3 64 62 a1 f9 f6 bb fe fa 33 46 e8 1c 29 35 03 a3 
  ee 9c 33 78 1f 58 27 54 49 4e 80 b3 f6 d2 b6 af e4 c0 
  dc 3d ff 69 46 5c 74 70 61 c3 eb cf 79 9c 9f f0 02 7a 
  41 61 5e 38 87 47 1f 3c ba f9 29 07 df 07 d7 50 70 62 
  e5 1a de 02 e4 20 8e 2b b3 12 25 e0 fa 1a fd ec 7b f5 
  39 7d 95 13 b7 5a 38 bd ff ff 3e 72 72 e9 5c 37 7a 27 
  c2 d4 b1 c3 a9 7f 8a ac ea 67 ce dc 0c b3 eb d4 63 7c 
  73 ed 67 56 8a e6 dd 2e cb b3 ee a9 7e 1f 9e 8a d8 3c 
  df e8 08 6b ba 5c b5 c6 b1 c1 0d b1 17 ed f6 dd af 5b 
  20 71 0a 6f

*/



void SimulateTagHfListen(void)
{
  uint8_t *dest = (uint8_t *)BigBuf+FREE_BUFFER_OFFSET;
  uint8_t v = 0;
  int i;
  int p = 0;
  OLEDClear();
  
  OLEDPutstr("SimulateTagHfListen");
  OLEDDraw();	  
  
  // We're using this mode just so that I can test it out; the simulated
  // tag mode would work just as well and be simpler.
  FpgaWriteConfWord(FPGA_MAJOR_MODE_HF_READER_RX_XCORR | FPGA_HF_READER_RX_XCORR_848_KHZ | FPGA_HF_READER_RX_XCORR_SNOOP);
  
  // We need to listen to the high-frequency, peak-detected path.
  SetAdcMuxFor(GPIO_MUXSEL_HIPKD);
  
  FpgaSetupSsc(1);
  
  __disable_irq();
  
  i = 0;
  for(;;) {
    
    {
      uint8_t r = softspi_rx();
      
      v <<= 1;
      if(r & 1) {
	v |= 1;
      }
      p++;
      
      if(p >= 8) {
	dest[i] = v;
	v = 0;
	p = 0;
	i++;
	
	if(i >= FREE_BUFFER_SIZE) {
	   i = 0;//break;
	}
      }
    }
  }
  __enable_irq();
  FpgaSetupSsc(0);
  DbpString("simulate tag (now type bitsamples)");
}

// starts here
int main(void)
{
  #define BufferSize 32
  
#ifdef DEBUG
  debug();
#endif
  
// _WDWORD(0x40023830, 0x00000010);
  
  /* System Clocks Configuration **********************************************/
  // if this fails (xtal fault ) LED will blink indefinitely short off ,long on, repeat
  if( Set_System() == 0 ) {
    return -1;
  }
  
  LEDSet( 1 );
  
  /* NVIC Configuration *******************************************************/
  NVIC_Configuration();
  
  /* note DelaymS uses this, so don't use DelaymS before this, DelayuS doesnt but is just a counter */
  
  /* SysTick end of count event each 1ms with input clock equal to 9MHz (HCLK/8, default) */
  SysTick_SetReload(9000);
  
  /* Enable SysTick interrupt */
  SysTick_ITConfig(ENABLE);
  
  // USB Enable
  //InitBoard();
  
  EXTI_Configuration();
  
  // Startup OLED
  InitOLED();
  
  OLEDPutstr("FPGA INIT\n");
  OLEDDraw();
  LEDSet(0);
  
  OLEDClear();
  
  /* Enable ADC1 reset calibaration register */   
  ADC_ResetCalibration(ADC1);
  
  /* Check the end of ADC1 reset calibration register */
  while(ADC_GetResetCalibrationStatus(ADC1));
  
  /* Start ADC1 calibaration */
  ADC_StartCalibration(ADC1);
  
  /* Check the end of ADC1 calibration */
  while(ADC_GetCalibrationStatus(ADC1));  
  
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
    
  // Kicks off the 24Mhz PCK0 (DOUT/PA10)
  SetupPCK0Clock();
  
