glocklueng/032/LayerOne_2014/badge/code/stm32-prox/main.c
  FpgaDownloadAndGo();
    
  FpgaWriteConfWord(FPGA_MAJOR_MODE_HF_READER_RX_XCORR | FPGA_HF_READER_RX_XCORR_848_KHZ | FPGA_HF_READER_RX_XCORR_SNOOP);
    
  // We need to listen to the high-frequency, peak-detected path.
  SetAdcMuxFor(GPIO_MUXSEL_HIPKD);
  
  FpgaSetupSsc(1);
  
  
  /*-----------------ARKO'S TEST CODE - SPI SLAVE-----------------------------*/
  // Start SPI Slave
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

  /* Enable SPI2 Periph clock */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);
  
  GPIO_InitTypeDef GPIO_InitStructure;
  /* Configure SPIz pins: SCK, MISO and MOSI */
  //GPIO_InitStructure.GPIO_Pin = SSP_FRAME_PIN | SSP_DIN_PIN |SSP_DOUT_PIN | SSP_CLK_PIN;
  //GPIO_Init(GPIOB, &GPIO_InitStructure);
  
  /* SPIz Config */
  SPI_InitStructure.SPI_Direction = SPI_Direction_1Line_Rx;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Slave;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_16b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;   // high
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;  // 1edge // Sample on clock falling edge
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 15;
  SPI_Init(SPI2, &SPI_InitStructure);
  
  /* Enable SPIz */
  SPI_Cmd(SPI2, ENABLE);
  
  uint16_t TxIdx = 0;
  uint16_t RxIdx = 0;
  uint16_t SPIz_Buffer_Tx[BufferSize] = {0xFFFF};
  
  uint16_t SPIy_Buffer_Rx[BufferSize], SPIz_Buffer_Rx[BufferSize];
  
  /* Transfer procedure */
  while (TxIdx < BufferSize)
  {
    /* Wait for SPIz data reception */
    while (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_RXNE) == RESET);
    /* Read SPIz received data */
    SPIz_Buffer_Rx[RxIdx] = SPI_I2S_ReceiveData(SPI2);
  }
  /*-------------- END ARKO'S TEST CODE - SPI SLAVE---------------------------*/
  
  SimulateTagHfListen();

  //SimulateTagLowFrequency(1000,100,1);

  CmdHIDsimTAG(0x20,0x06040ef9 , 1);
  
#if 0
  OLEDClear();
  OLEDPutstr("FPGA TEST MODE\n");
  OLEDDraw();
  
  HIGH(FPGAON);					// Enable VREG's
  DelaymS(100);
  
  // about 1.3MHz
  while(1) {
    LOW(NCS);
    DelayuS(1);
    HIGH(NCS);
    DelayuS(1);
  }
  
  while(1) {
    LOW(GPIO_FPGA_DIN);
    HIGH(GPIO_FPGA_DIN);
  }
#endif
  
  OLEDClear();
  OLEDPutstr("SYSTEM INIT\n");
  OLEDPutstr("SYSTEM READY\n");
  OLEDDraw();
  
  DelaymS(1000);
  
  OLEDDisplayPicture( l1logo_inv );
  OLEDDraw();
  
  DelaymS(1000);

  MeasureAntennaTuningHf();
    
  CmdHIDsimTAG(0x20,0x06040ef9 , 1);
    
  ListenReaderField(0);
  
  MeasureAntennaTuning();
  DelaymS( 5000 );
  
  // button test
  while( 1 ) {
    
    OLEDClear();
    
    if( !GETBIT( SW_K1 ) ){
      OLEDPutstr("K1 ON\n");
      
    } else{
      OLEDPutstr("K1 OFF\n");
    }
    
    if( !GETBIT( SW_K2 ) ){
      OLEDPutstr("K2 ON\n");
      //cycleFPGAMode();
      DelaymS(100);
        MeasureAntennaTuningHf();  
       DelaymS(100);
    } else {
      OLEDPutstr("K2 OFF\n");
    }
#ifdef SW_K3_PORT
    if( !GETBIT( SW_K3 ) ){
      OLEDPutstr("K3 ON\n");
    }else
      OLEDPutstr("K3 OFF\n");
#endif
    
    if( !GETBIT( GPIO_FPGA_DONE ) ){
      OLEDPutstr("FPGA_DONE ON\n");
    }else
      OLEDPutstr("FPGA_DONE OFF\n");
    
    if( !GETBIT( GPIO_FPGA_NINIT ) ){
      OLEDPutstr("FPGA_NINIT ON\n");
    }else
      OLEDPutstr("FPGA_NINIT OFF\n");
    
    if( GETBIT( GPIO_OE1 ) ){ 
      OLEDPutstr("OE1 ");
    }	
    if( GETBIT( GPIO_OE2 ) ){ 
      OLEDPutstr("OE2 ");
    }	
    if( GETBIT( GPIO_OE2 ) ){ 
      OLEDPutstr("OE3 ");
    }	
    if( GETBIT( GPIO_OE4 ) ){ 
      OLEDPutstr("OE4                   \n");
    }	
    
    OLEDDraw();
  }
  
  OLEDClear();
  
  SimulateTagLowFrequency(1000,100,1);
 
  MeasureAntennaTuningHf();  
  DelaymS( 500 );
  DelaymS(25000);
  
  ////////////////// Shut down 
  
  LOW(FPGAON);					// ensure everything is powered off
  HIGH(NVDD_ON);				// ensure everything is powered off
  
  OLEDClear();
  OLEDPutstr("SHUTTING DOWN\n\nBYE BYE\n\nLAYERONE 2014");
  OLEDDraw();
  
  return 0;
}
